added all design
